DataProcessors/ИА_РабочийСтолОтделаПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_РабочийСтолОтделаПерсонала</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_ДоступныеИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДоступныеИнструкции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ИзучениеДИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ИзучениеДИ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СрокСдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Инструкции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ИА_РабочийСтолОтделаПерсонала/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуОшляпливания();
	ОбновитьТаблицуСдачи();
КонецПроцедуры


&НаСервере
Процедура ОбновитьТаблицуОшляпливания()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИА_ДоступныеИнструкции.Пользователь,
	               |	ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка) КАК Пост
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции";
	тзПользПост = Запрос.Выполнить().Выгрузить();
	Для каждого стр из тзПользПост Цикл
		пост = ИА_ОбщиеПроцедуры_Технология_КоммЦентр.ПолучитьВысокийПостПользователя(стр.Пользователь);
		Если пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Департамент и пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.РуководящийСостав и пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Учредитель Тогда
			Пока пост.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Департамент и пост <> Справочники.ОргСхема.ПустаяСсылка() Цикл
				пост = пост.родитель;			
			КонецЦикла;
		КонецЕсли;
		
		стр.Пост = пост;
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Пользователь,
	               |	ТЗ.Пост
	               |ПОМЕСТИТЬ ПользПосты
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ДоступныеИнструкции.Пользователь КАК Пользователь,
	               |	ПользПосты.Пост КАК Пост,
	               |	ИА_ДоступныеИнструкции.Инструкция КАК Инструкция,
	               |	КОЛИЧЕСТВО(*) КАК КоличествоДИ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Отправлено,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.ДатаСдачи = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Сдано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ИА_ИзучениеДИСрезПоследних.Пользователь ЕСТЬ NULL
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.СрокСдачи = ДАТАВРЕМЯ(1, 1, 1)
	               |					ИЛИ ИА_ИзучениеДИСрезПоследних.СрокСдачи > НАЧАЛОПЕРИОДА(&ТекВремя, ДЕНЬ)
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Просрочено
	               |ИЗ
	               |	РегистрСведений.ИА_ДоступныеИнструкции КАК ИА_ДоступныеИнструкции
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ИзучениеДИ.СрезПоследних КАК ИА_ИзучениеДИСрезПоследних
	               |		ПО ИА_ДоступныеИнструкции.Пользователь = ИА_ИзучениеДИСрезПоследних.Пользователь
	               |			И ИА_ДоступныеИнструкции.Инструкция = ИА_ИзучениеДИСрезПоследних.Инструкция
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПользПосты КАК ПользПосты
	               |		ПО ИА_ДоступныеИнструкции.Пользователь = ПользПосты.Пользователь
	               |ГДЕ
	               |	ПользПосты.Пост <> ЗНАЧЕНИЕ(Справочник.Оргсхема.ПустаяСсылка)
	               |	И (НЕ ИА_ДоступныеИнструкции.Пользователь.ПометкаУдаления)
				   |	И (НЕ ИА_ДоступныеИнструкции.Инструкция.ЭтоГруппа)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_ДоступныеИнструкции.Пользователь,
	               |	ПользПосты.Пост,
	               |	ИА_ДоступныеИнструкции.Инструкция
	               |ИТОГИ
	               |	СУММА(КоличествоДИ),
	               |	СУММА(Отправлено),
	               |	СУММА(Сдано),
	               |	СУММА(Просрочено)
	               |ПО
	               |	ОБЩИЕ,
	               |	Пост,
	               |	Пользователь";
	
	Запрос.УстановитьПараметр("тз", тзПользПост);
	Запрос.УстановитьПараметр("ТекВремя", ТекущаяДата());
	
	дерево = запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДерФормы = РеквизитФормыВЗначение("АнализОшляпливания");
	ДерФормы.Строки.Очистить();
	
	Для каждого стрОи из дерево.Строки Цикл
		НовстрОи = ДерФормы.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовстрОи, стрОи);
		НовстрОи.Узел = "Всего";
		НовстрОи.УО = 1;
		
		ЗаполнитьПроценты(НовстрОи);		
		Для каждого стрПост из стрОи.Строки Цикл			
			
			Если СкрытьПосты Тогда
				НовстрПост = НовстрОи;	
			Иначе
				НовстрПост = НовстрОи.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НовстрПост, стрПост);
				НовстрПост.Узел = стрПост.Пост;
				НовстрПост.УО = 2;				
				ЗаполнитьПроценты(НовстрПост);
			КонецЕсли;
			
			Для каждого стрПользователь из стрПост.Строки Цикл
				НовстрПользователь = НовстрПост.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НовстрПользователь, стрПользователь);
				НовстрПользователь.Узел = стрПользователь.Пользователь;
				НовстрПользователь.УО = 3;
				
				ЗаполнитьПроценты(НовстрПользователь);
				Для каждого стрДИ из стрПользователь.Строки Цикл
					НовстрДИ = НовстрПользователь.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НовстрДИ, стрДИ);
					НовстрДИ.Узел = стрДИ.Инструкция;
					
					НовстрДИ.УО = 4;
				КонецЦикла;
			КонецЦикла;			
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДерФормы,"АнализОшляпливания");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАнализОшл(Команда)
	ОбновитьТаблицуОшляпливания();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПроценты(Новстр)
	Новстр.ОтправленоПроцент = ФОРМАТ((Новстр.Отправлено / Новстр.КоличествоДИ) * 100,"ЧДЦ=0; ЧН=")  + "%";
	Новстр.СданоПроцент = ФОРМАТ((Новстр.Сдано / Новстр.КоличествоДИ) * 100,"ЧДЦ=0; ЧН=")  + "%";
	Новстр.ПросроченоПроцент = ФОРМАТ((Новстр.Просрочено / Новстр.КоличествоДИ) * 100,"ЧДЦ=0; ЧН=")  + "%";
КонецПроцедуры


&НаКлиенте
Процедура АнализОшляпливанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	узел = Элемент.ТекущиеДанные.Узел;
	Если ТипЗнч(Узел) = тип("СправочникСсылка.ИА_Инструкции") Тогда
		ПоказатьЗначение(,Узел);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСдачи()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.Пользователь КАК Пользователь,
	               |	Таб.Инструкция КАК Инструкция,
	               |	Таб.Период КАК ДатаЗадания,
	               |	Таб.СрокСдачи КАК Срок,
	               |	Таб.ДатаСдачи КАК ДатаСдачи,
	               |	ВЫБОР
	               |		КОГДА Таб.СрокСдачи <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И Таб.ДатаСдачи = ДАТАВРЕМЯ(1, 1, 1)
	               |				И НАЧАЛОПЕРИОДА(Таб.СрокСдачи, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекВремя, ДЕНЬ)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Просрочено
	               |ИЗ
	               |	РегистрСведений.ИА_ИзучениеДИ.СрезПоследних КАК Таб 
				   |ГДЕ 
				   |	(НЕ Таб.Пользователь.ПометкаУдаления) И (НЕ Таб.Инструкция.ЭтоГруппа)
	               |ИТОГИ ПО
	               |	%Пользователь%";
	
	Если РежимОтчетаПоСдаче = 0 Тогда   // по юзеру
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Пользователь%","Пользователь");
		Элементы.АнализСдачиУзел.Заголовок = "Сотрудник / Инструкция";
	ИначеЕсли РежимОтчетаПоСдаче = 1 Тогда // по ди
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Пользователь%","Инструкция");
		Элементы.АнализСдачиУзел.Заголовок = "Инструкция / Сотрудник";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекВремя", ТекущаяДата());
	
	дерево = запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДерФормы = РеквизитФормыВЗначение("АнализСдачи");
	ДерФормы.Строки.Очистить();
	
	Для каждого ур1 из дерево.Строки Цикл
		НовстрУр1 = ДерФормы.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовстрУр1, ур1);
		НовстрУр1.Узел = ?(РежимОтчетаПоСдаче = 0 , ур1.Пользователь, ур1.Инструкция);

		Для каждого ур2 из ур1.Строки Цикл			
			НовстрУр2 = НовстрУр1.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НовстрУр2, ур2);
			НовстрУр2.Узел = ?(РежимОтчетаПоСдаче = 0 , ур2.Инструкция, ур2.Пользователь);
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДерФормы,"АнализСдачи");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОзнакомление(Команда)
	ОбновитьТаблицуСдачи();
КонецПроцедуры

&НаКлиенте
Процедура СдачаПоСотрудникамПриИзменении(Элемент)
	ОбновитьТаблицуСдачи();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПостыПриИзменении(Элемент)
	ОбновитьТаблицуОшляпливания();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСписокИнструкций(Команда)
	ОткрытьФорму("Обработка.ИА_РаботаСИнструкциями.Форма.ФормаУправляемая");
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкаПрав(Команда)
	ОткрытьФорму("Обработка.ИА_УстановкаУровнейДоступаПользователей.Форма.ФормаУправляемая");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправочникИнструкций(Команда)
	ОткрытьФорму("Справочник.ИА_Инструкции.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаданияСотрудника(Команда)
	тд = Элементы.АнализОшляпливания.ТекущиеДанные;
	Если тд<>Неопределено и ТипЗнч(тд.Узел) = Тип("СправочникСсылка.Пользователи") Тогда
		ПоказатьЗаданияСотрудникаОбщ(тд.Узел);
	Иначе
		ПоказатьПредупреждение(,"Выберите сотрудника!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаданияСотрудникаОбщ(Сотр)
	ЗаданияДИ.Отбор.Элементы.Очистить();
	
	ЭлементОтб = ЗаданияДИ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
	ЭлементОтб.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтб.ПравоеЗначение = Сотр;
	ЭлементОтб.Использование = истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаданияСотрудника1(Команда)
	тд = Элементы.АнализСдачи.ТекущиеДанные;
	Если тд<>Неопределено и ТипЗнч(тд.Узел) = Тип("СправочникСсылка.Пользователи") Тогда
		ПоказатьЗаданияСотрудникаОбщ(тд.Узел);
	Иначе
		ПоказатьПредупреждение(,"Выберите сотрудника!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтборы(Команда)
	ЗаданияДИ.Отбор.Элементы.Очистить();
КонецПроцедуры
